
#  1: 다음처럼 동작하는 함수 작성. 
# string argument로 이름을 넣으면, 다음처럼 "Hello name" (입력한 이름) 출력하는 함수




# 2: 다음처럼 동작하는 함수 작성. 
# string argument로 이름을 넣으면, 다음처럼 "Hello name"(입력한 이름) 이라는 문자열을 반환하는 함수.



# 3: 두 수를 입력하면, 두수의 곱을 반환하는 함수.


# 4: 정수와 벡터를 입력받는 함수로서, 해당 정수가 벡터에 존재하면 TRUE를 반환하고 그렇지 않으면 FALSE를 리턴하는 함수 

# 호출 예) num_check(2,c(1,2,3))



# 5: 정수와 벡터를 입력받는 함수로서, 정수가 벡터안에 몇개가 있는지 카운트 하는 함수 작성. 몇개인지를 리턴하는 함수.

# 호출 예) num_count(2,c(1,1,2,2,3,3))   
#          2


# 6: 3 integer 를 입력하면, 합을 리턴하는 함수이되,
# 세 수 중에 3의 배수가 있으면, 3의배수는 합에 계산하지 않는다.
# 3 수가 모두 3의 배수면 0이다.
# Hint: append() 함수를 활용하세요.

# 예) 
# summer(7,2,3)
# 9
# summer(3,6,9)
# 0
# summer(9,11,12)
# 11

